<?php
//laba4
$arr6=['a'=>11,
    'b'=>20,
    'c'=>30];
echo $arr6['c']." ";
echo $arr6['c']+$arr6['b']+$arr6['a'] ;
echo '<br>';
//2
$arr7=['q3'=>12, 'r3'=>23, 'f3'=>34];
echo $arr7['q3']+$arr6['r3']+$arr6['f3'] ."   ";
echo '<br>';
//3.php
$arr7=['Коля'=>'1000$', 'Вася'=>'500$', 'Петя'=>'200$'];
echo $arr7['Петя']." ".$arr7['Коля'] ;
echo '<br>';

//4
$arr12=['1'=>'Январь', '2'=>'Февраль', '3.php'=>'Март', '4'=>'Апрель', '5'=>'Май', '6'=>'Июнь', '7'=>'Июль', '8'=>'Август', '9'=>'Сентябрь', '10'=>'Октябрь', '11'=>'Ноябрь', '12'=>'Декабрь'];
echo $arr12['9']." ".$arr12['6'];
echo '<br>';
//5
$day=3;
$arr25=['1'=>'пн', '2'=>'вт', '3.php'=>'ср', '4'=>'чт', '5'=>'пт', '6'=>'сб', '7'=>'вс'];
echo "  ".$arr25[$day];
echo '<br>';
?>